#include <z64ovl/oot/debug.h>
#include <z64ovl/oot/helpers.h>

#define OBJ_ID 1

typedef struct {
	/* 0x0000 */ z64_actor_t actor;
	/* 0x014C */ z64_collider_cylinder_main_t collider_main;
	/* 0x0198 */ z64_collider_cylinder_collection_t cyl_list;
	/* 0x01B8 */ z64_collider_cylinder_t collider_hit;
	/* 0x01F8 */ uint16_t unk_01F8;
	/* 0x01FA */ uint16_t flash_speed;
	/* 0x01FC */ float unk_01FC;
	/* 0x0200 */ uint8_t unk_0200;
	/* 0x0201 */ uint8_t unk_0201;
	/* 0x0204 */ z64_actorfunc_t *machine_state
} entity_t; /* 0208 */


/*** function prototypes ***/
void state_set_809C26D0(entity_t *en, z64_actorfunc_t *state); /* Rewritten */
void dest_809C27EC(entity_t *en, z64_global_t *gl); /* Rewritten */
void state_809C2A38(entity_t *en, z64_global_t *gl); /* Rewritten */
void draw_809C3218(entity_t *en, z64_global_t *gl); /* Rewritten */
void init_809C26D8(entity_t *en, z64_global_t *gl); /* Rewritten */
void state_809C282C(entity_t *en, z64_global_t *gl); /* Rewritten */
void state_main_809C2B88(entity_t *en, z64_global_t *gl); /* 1 internal, 17 external, 445 lines */
void state_809C29F4(entity_t *en, z64_global_t *gl); /* Rewritten */


/*** variables ***/
const uint32_t data_809C3430[] =
{
	0x00002939,
	0x20010000,
	0x02000000,
	0x00000000,
	0x00000000,
	0x0003F828,
	0x00000000,
	0x00010100,
	0x0006000B,
	0x000E0000,
	0x00000000
};
const uint32_t data_809C345C[] =
{
	0x00000000,
	0x00000008,
	0x00080000,
